{
    "1": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will devote your life to an anal only lifestyle.",
        "exam1": "Wear a buttplug (size XL) for 4 hours. Then fuck your ass with a dildo (size XL) for 40minutes. Keep going even if you cum.",
        "exam2": "Wear a buttplug (size L) for 1440minutes.",
        "exam3": "Cum from anal 2 times in 1440minutes. Use a dildo (size XL).",
        "id": "1",
        "imgUrl": "1373",
        "name": "Anal Technologies",
        "name2": "anal",
        "prerequisites": "311 312 402",
        "tags": "anal",
        "tier": "1",
        "type": "major"
    },
    "10": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will learn to work with medical equipment and perform various procedures.",
        "exam1": "Insert a 8.5mm x 80mm sound 30 times.",
        "exam2": "Insert a 11.5mm x 120mm sound 10 times.",
        "exam3": "Wear a catheter 7.5mm x 70mm for 3 hours.",
        "id": "10",
        "imgUrl": "1114",
        "name": "Medical Technologies",
        "name2": "urethra sounding",
        "prerequisites": "408",
        "tags": "sounding",
        "tier": "1",
        "type": "major"
    },
    "11": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will study the effects of prolonged sexual torment.",
        "exam1": "Masturbate to the point of orgasm and continue all stimulation for 5minutes after cumming.",
        "exam2": "Masturbate to the point of orgasm and continue all stimulation until you cum again.",
        "exam3": "For a period of 10080minutes edge 3 times a day but don't cum. Then on the last day cum 5 times.",
        "id": "11",
        "imgUrl": "491",
        "name": "Orgasm Science",
        "name2": "forced orgasms, orgasm denial, post-orgasm torture",
        "prerequisites": "409 413",
        "tags": "orgasm",
        "tier": "1",
        "type": "major"
    },
    "12": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will become proficient at pleasing cocks with your mouth and consuming large amounts of cum.",
        "exam1": "Give a blowjob to a dildo (size L) for 45minutes and use cum (real or fake) as lube. Reapply it every 5 minutes.",
        "exam2": "Deepthroat (23cm/~9inch) a dildo (size XL) 40 times in one sitting. After you're done deepthroat it another 10 times for 6 seconds each.",
        "exam3": "Use a squirting dildo (size L). Give it blowjob for 15minutes with at least 30 deepthroats (19cm/~7.5inch). On your last one, deepthroat it as far as you can and squirt 50ml of fake cum down your throat.",
        "id": "12",
        "imgUrl": "1346",
        "name": "Oral Technologies",
        "name2": "oral, cum-play",
        "prerequisites": "405 406",
        "tags": "oral",
        "tier": "1",
        "type": "major"
    },
    "13": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will become a sex slave who derives pleasure from pain.",
        "exam1": "Gag yourself. Make a clothespin zipper that runs from one of your breasts, around your navel and back to the other breast (20 clothespins minimum). Keep it on and spank your ass until it becomes red (50 times minimum). Then pull the zipper hard and fast.",
        "exam2": "Attach clothespins to your nipples and insert a buttplug/vibrator/dildo in your ass. Tie yourself in a hogtie/frog-tie/mummy-tie for 60minutes while blindfolded and gagged.",
        "exam3": "Go in chat or online and request 10 slave tasks to perform which preferably include bondage and pain. Spank your ass hard 20 times and your balls/pussy 10 times for every task you refuse.",
        "id": "13",
        "imgUrl": "114",
        "name": "Sex Slavery",
        "name2": "bondage, masochism, submission",
        "prerequisites": "414 420",
        "tags": "slave",
        "tier": "1",
        "type": "major"
    },
    "2": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will take control of your gender and become a female in all ways except one.",
        "exam1": "Spend 20160minutes in chastity while wearing cute underwear. You can cum only from anal.",
        "exam2": "Spend 10080minutes in chastity while wearing cute underwear. Wear at least one cute piece of clothing (skirt/dress/pantyhose/stockings/heels etc) during the day for at least 4 hours (can be hidden under clothes). You can cum only from anal. Make sure your crotch and armpits are shaved.",
        "exam3": "Spend 2880minutes in chastity while dressed like a girl - underwear, makeup, nails, wig (long hair) and cute clothes. Cum from anal at least once. Make sure your whole body is shaved smooth.",
        "id": "2",
        "imgUrl": "1383",
        "name": "Gender Studies",
        "name2": "chastity, feminization",
        "prerequisites": "403 404",
        "tags": "feminization chastity",
        "tier": "1",
        "type": "major"
    },
    "3": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will study the effects of sexual frustration on the human psyche.",
        "exam1": "For 20160minutes - edge 1 time every day. If you cum, add 4 days to your time (press Punish).",
        "exam2": "For 14400minutes - edge 2 times every day. Keep yourself in chastity for the rest of the time. If you cum, add 3 days to your time (press Punish).",
        "exam3": "For 10080minutes - edge 3 times a day. Keep yourself locked in chastity for the rest of the time. If you cum, add 2 days to your time (press Punish).",
        "id": "3",
        "imgUrl": "566",
        "name": "Sex Psychology",
        "name2": "chastity, orgasm denial",
        "prerequisites": "403 413",
        "tags": "chastity masturbation",
        "tier": "1",
        "type": "major"
    },
    "5": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will master various fluids.",
        "exam1": "Hold a 1500ml enema (any liquid) for 15minutes.",
        "exam2": "Take a 1000ml enema for 10minutes and drink at least 200ml (10oz) of piss in the meantime.",
        "exam3": "Fill an enema bag (container) with 600ml of piss and run the tube down to your mouth. Slowly drink it all up. (If you tie yourself and use a gag, you can go with just 400ml of piss)",
        "id": "5",
        "imgUrl": "944",
        "name": "Fluid Mechanics",
        "name2": "enemas, watersports",
        "prerequisites": "401",
        "tags": "fluid",
        "tier": "1",
        "type": "major"
    },
    "6": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will serve the public.",
        "exam1": "Go in chat or online and request 10 lewd tasks to perform. Take photos/videos while performing them and share them with the others.",
        "exam2": "Do a 60minutes live stream and perform any sex acts others request in chat.",
        "exam3": "Go outside and take a 30 minute walk wearing at least 5 items or clothes from other classes. \"Examples\": fully dressed as a girl or in latex / wearing a tail, animal ears and a collar / wearing chastity cage, a buttplug and a small vibrator / wearing a rope harness, clothespins and cuffs / etc",
        "id": "6",
        "imgUrl": "103",
        "name": "Public Relations",
        "name2": "exhibitionism, slave",
        "prerequisites": "416 420",
        "tags": "exhibitionism",
        "tier": "1",
        "type": "major"
    },
    "7": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will learn to use all of your holes to give and receive pleasure.",
        "exam1": "Spitroast yourself for 30minutes with two dildos (sizes L and XL)",
        "exam2": "Fuck yourself in the ass with a dildo (size XL) for 20minutes. Leave it in and then give another one (size L) a 15minutes blowjob with at least 50 deepthroats.",
        "exam3": "Insert a dildo size XL in your ass and leave it in. Then deepthroat another one (size L) for 5 seconds - 15 times.",
        "id": "7",
        "imgUrl": "1399",
        "name": "Sex Trades",
        "name2": "anal, oral, double penetration",
        "prerequisites": "415 ",
        "tags": "anal oral",
        "tier": "1",
        "type": "major"
    },
    "8": {
        "daily1": "none",
        "daily2": "none",
        "days": "1 2 3 4 5 6 7",
        "description": "Do you like pets? Well now you'll get to be one!",
        "exam1": "For a period of 1440minutes - wear animal ears, a collar and a tail. Drink and eat from a bowl on the floor. Walk on all fours. Sleep in a cage. You may have four 30 minute rests.",
        "exam2": "For a period of 240minutes - wear animal ears, a collar and a buttplug tail and tie yourself in a bitchsuit position.",
        "exam3": "Spread your sex toys or other objects (20 minimum) around your apartment so that they could easily be reached by a toddler. Apply animal ears and a buttplug tail. Tie yourself in a bitchsuit position. Start collecting your toys one by one by bringing them to a common place with your mouth. You are done when all the toys have been gathered at one place. You have 180minutes.",
        "id": "8",
        "imgUrl": "116",
        "name": "Pet Science",
        "name2": "pet-play",
        "prerequisites": "417",
        "tags": "pet",
        "tier": "1",
        "type": "major"
    },
    "9": {
        "daily1": "none",
        "daily2": "none",
        "description": "You will explore a variety of fetish clothing materials such as latex, leather, PVC and vinyl.",
        "exam1": "Wear four pieces of fetish clothing or a catsuit for 1440minutes today.",
        "exam2": "Wear a full catsuit (bodysuit) made of out latex/leather/pvc or vinyl for 720minutes today",
        "exam3": "Wear a full catsuit (bodysuit) made out of latex/leather/pvc or vinyl and a gas mask for 360minutes today.",
        "id": "9",
        "imgUrl": "1278",
        "name": "Fetish Design",
        "name2": "fetish clothing",
        "prerequisites": "418",
        "tags": "fetish",
        "tier": "1",
        "type": "degree"
    }
}